# int = 1   # целые числа
# int = 43743485

# float = 45.02   # числа с плавающей точкой
# float = 2.782   

# str = "Text"     #    строки (например, "hello", "Python")
# str = "kjdhfgkfjdmdnl"

# list = [1, 2, 3, 4]     # списки, упорядоченные изменяемые коллекции 
# list = [5, 1, 7, 4, 6, 9]

# tuple = (1, 2, 3, 4)      # кортежи, упорядоченные неизменяемые коллекции 

# dict = {"name:" "Pawel", "age:" 56}   #  словари, неупорядоченные изменяемые коллекции пар ключ-значение

# set = {1, 2, 3, 4}    #  множества, неупорядоченные коллекции уникальных элементов

# boolen (true/false)   # bулевые значения (True, False), которые являются результатами логических операций.   



# Задания:
# Напиши программу, которая принимает строку от пользователя и выводит количество уникальных символов в ней.

# Пример 1:
# Ввод: "hello"
# Вывод: 4 (символы: h, e, l, o).
# Создай список с числами и строками, а затем напиши код, который выводит только те элементы списка, которые являются строками.

# Пример 2:
# Ввод: [1, "apple", 3, "banana", "cherry", 5]
# Вывод: ["apple", "banana", "cherry"].


print("Hello user,  I'm your program!")
name = input("Please write your name : ")
print(f"Your name is : {name}")
print(f"Your name have a {name} letters")




